blogs/xcapture-introduce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-29 日 13:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>xcapture 介绍</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">xcapture 介绍</h1>
<p>
<a href="https://0x.tools/">xcapture</a> 是 0x.tools 中的一个工具，用于记录Linux进程快照，包括进程状态、命令、内核栈等。非常适合排查没有现场的故障。
例如：=xcapture -d 10 -c exe,cmdline,kstack -o <i>var</i>log/xcaputre= 每10秒记录一次，包括内核栈，不记录S状态的线程，输出是csv格式的文件。
</p>

<p>
统计xcaputre的输出非常重要。
</p>

<div id="outline-container-orgb90c9d1" class="outline-2">
<h2 id="orgb90c9d1"><span class="section-number-2">1</span> 根据xcapture生成火焰图</h2>
<div class="outline-text-2" id="text-1">
<p>
火焰图非常适合发现热点，无论是CPU热点、还是等待热点。以火焰图的形式呈现xcapture的内核栈非常直观。例如：这是kafka卡顿的日志，
</p>

<pre class="example">
2023-10-08 23:00:50.215,111791,113149,kafka,D,(kafka-network-t),sendfile,0,java,/usr/local/bin/java,-&gt;__x64_sys_sendfile64()-&gt;do_sendfile()-&gt;do_splice_direct()-&gt;splice_direct_to_actor()-&gt;generic_file_splice_read()-&gt;xfs_file_read_iter()-&gt;xfs_file_buffered_aio_read()-&gt;generic_file_buffered_read()-&gt;io_schedule()
</pre>

<p>
flamegraph 可以把如下文本格式的数据转成火焰图：
</p>
<ol class="org-ol">
<li>第一列是 <code>;</code> 分割的调用栈（栈顶在最后）</li>
<li>第二列是 <code>调用栈</code> 的次数</li>
</ol>

<pre class="example">
__x64_sys_epoll_wait();do_epoll_wait();ep_poll() 9984
retint_user();prepare_exit_to_usermode();exit_to_usermode_loop() 14058
 __x64_sys_futex();do_futex();futex_wait();futex_wait_queue_me() 49866
</pre>

<p>
转化脚本如下，含义见注释：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">2023-10-08.23.csv &#26159; xcapture &#30340;&#26085;&#24535;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">grep xfs&#65306; &#21482;&#32479;&#35745; xfs &#30456;&#20851;&#30340;&#26632;&#65292;&#21487;&#20197;&#28789;&#27963;grep&#65292;&#21482;&#32479;&#35745;&#24863;&#20852;&#36259;&#30340;&#37096;&#20998;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">awk&#65306;&#33719;&#21462;&#20869;&#26680;&#26632;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">tr&#12289;cut&#65306;&#29992;&#20110;&#36716;&#25442;&#20869;&#26680;&#26632;&#30340;&#26684;&#24335;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">sort&#12289;uniq&#65306;&#29992;&#20110;&#32479;&#35745;&#26632;&#30340;&#27425;&#25968;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">flamegraph.pl&#65306;&#29992;&#20110;&#29983;&#25104;&#28779;&#28976;&#22270;</span>

grep xfs 2023-10-08.23.csv  | awk -F, <span style="color: #ffa07a;">'{print $NF}'</span> | tr -d <span style="color: #ffa07a;">'-'</span> | tr <span style="color: #ffa07a;">'&gt;'</span> <span style="color: #ffa07a;">';'</span> | cut -c2- | sort  | uniq -c | sort -n | awk <span style="color: #ffa07a;">'{print $2,$1}'</span> | flamegraph.pl &gt; xfs.html

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#32479;&#35745;D&#12289;R&#36827;&#31243;</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">'{print $NF,$2}'&#65292;&#25226;&#36827;&#31243;&#20063;&#21253;&#21547;&#22312;&#28779;&#28976;&#22270;&#20013;</span>
grep -E <span style="color: #ffa07a;">",D|R,"</span>  2023-10-19.10.csv | awk -F, <span style="color: #ffa07a;">'{print $NF,$2}'</span> | tr -d <span style="color: #ffa07a;">'-'</span> | tr <span style="color: #ffa07a;">'&gt;'</span> <span style="color: #ffa07a;">';'</span> | cut -c2- | awk <span style="color: #ffa07a;">'{print $2 ";" $1}'</span>| sort  | uniq -c | sort -n | awk <span style="color: #ffa07a;">'{print $2,$1}'</span> | flamegraph.pl &gt; busy.html
</pre>
</div>
</div>
</div>

<div id="outline-container-orge26dcf5" class="outline-2">
<h2 id="orge26dcf5"><span class="section-number-2">2</span> 其它有用的统计</h2>
<div class="outline-text-2" id="text-2">
<p>
a) 统计每分钟R状态的进程
<code>grep ",R," 2023-10-20.14.csv | cut -c1-16 | sort | uniq -c | sort -n</code>
</p>

<p>
b) 统计每个进程的R状态的数量
<code>grep ",R," 2023-10-20.14.csv | awk -F, '{print $6}' | sort | uniq -c | sort -n</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-10-29 日 13:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
